Tekla Open API Reference for Tekla Structures 2025
ComponentOptions.BoltEdgeDistanceReference Property
The bolt edge distance reference.
 Namespace: Tekla.Structures
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ComponentOptions.BoltEdgeDistanceReferenceEnum BoltEdgeDistanceReference { get; set; }
Public Property BoltEdgeDistanceReference As ComponentOptions.BoltEdgeDistanceReferenceEnum
	Get
	Set
Property Value
Type: ComponentOptions.BoltEdgeDistanceReferenceEnum
See Also
Reference
ComponentOptions Class
Tekla.Structures Namespace